{
  "renee-good": {
    "id": "renee-good",
    "title": "Renee Good Case",
    "date": "2026-01-17",
    "status": "active",
    "summary": "U.S. citizen and mother of three shot by ICE agent in Minneapolis. Video contradicts official claims. Federal authorities blocking state investigation.",
    "keywords": ["ice", "minneapolis", "shooting", "obstruction", "citizen", "jonathan ross", "video"],
    "background": "On January 7, 2026, ICE Agent Jonathan Ross fatally shot Renee Nicole Good, a 37-year-old U.S. citizen, poet, and mother of three, on a Minneapolis street after she had dropped her 6-year-old son at school. Multiple videos show Good was not a threat—she smiled and said 'I'm not mad at you' moments before Ross fired three shots, first into her windshield and then through her open window. Video shows Ross was standing out of the vehicle's path when he opened fire. DHS Secretary Kristi Noem called it 'domestic terrorism.' Minneapolis Mayor Jacob Frey called that claim 'bullshit.' Governor Walz proclaimed January 9 'Renee Good Day.' Federal authorities reversed an agreement with Minnesota BCA and seized exclusive jurisdiction, blocking state investigators from all evidence.",
    "agencies": {
      "fbi": {
        "name": "FBI",
        "fullName": "Federal Bureau of Investigation",
        "description": "Leading investigation; blocking state access to evidence.",
        "email": "foiparequest@fbi.gov",
        "portal": "https://vault.fbi.gov/fdps-1/foia-request",
        "address": "Federal Bureau of Investigation\nAttn: FOIA/PA Request\nRecord/Information Dissemination Section\n170 Marcel Drive\nWinchester, VA 22602",
        "requests": [
          "All records related to the fatal shooting of Renee Nicole Good, a U.S. citizen, by ICE Agent Jonathan Ross on January 7, 2026, in Minneapolis, Minnesota.",
          "All video footage collected, including Agent Ross's cellphone video, bystander videos, and any surveillance footage.",
          "All communications between FBI and Minnesota BCA, Hennepin County Attorney, and Minnesota AG regarding investigation access and jurisdiction.",
          "All records related to the decision to exclude Minnesota authorities from joint investigation.",
          "All evidence collected: the ICE agent's firearm, ammunition casings, Renee Good's vehicle, forensic reports, and autopsy reports.",
          "All witness statements and investigative interviews conducted.",
          "All records related to ICE Agent Jonathan Ross, including prior incidents such as the June 2025 incident involving Roberto Carlos Munoz-Guatemala."
        ]
      },
      "dhs": {
        "name": "DHS",
        "fullName": "Department of Homeland Security",
        "description": "Secretary Noem made false public statements; blocking state investigation.",
        "email": "foia@hq.dhs.gov",
        "portal": "https://www.dhs.gov/foia",
        "address": "Department of Homeland Security\nPrivacy Office, Mail Stop 0655\n2707 Martin Luther King Jr. Ave. SE\nWashington, D.C. 20528-0655",
        "requests": [
          "All records related to the ICE enforcement operation on January 7, 2026, in Minneapolis, during which Renee Nicole Good was killed.",
          "All records related to DHS Secretary Kristi Noem's public statements characterizing Good as engaged in 'domestic terrorism.'",
          "All communications between DHS leadership and White House regarding this incident and public messaging.",
          "All video footage in DHS possession, including Agent Ross's cellphone video.",
          "All communications between DHS, ICE, FBI, and DOJ regarding federal jurisdiction and exclusion of Minnesota BCA.",
          "All records related to ICE Agent Jonathan Ross: employment records, training, prior complaints, the June 2025 vehicle-dragging incident, and current duty status.",
          "All records related to the decision to assert exclusive federal jurisdiction over this shooting."
        ]
      },
      "ice": {
        "name": "ICE",
        "fullName": "Immigration and Customs Enforcement",
        "description": "Agent Jonathan Ross records, use-of-force history, cellphone video.",
        "email": "ice-foia@ice.dhs.gov",
        "portal": "https://www.ice.gov/foia",
        "address": "U.S. Immigration and Customs Enforcement\nFreedom of Information Act Office\n500 12th Street, S.W., Stop 5009\nWashington, D.C. 20536-5009",
        "requests": [
          "All records related to ICE Agent Jonathan Ross: complete personnel file, employment history (Border Patrol 2007-2015, ICE 2015-present), training records, FBI Joint Terrorism Task Force membership, firearms instructor certifications.",
          "All records related to the June 2025 incident where Agent Ross was injured by Roberto Carlos Munoz-Guatemala, including Ross's testimony that he 'feared for his life.'",
          "All prior use-of-force incidents, complaints, and disciplinary actions involving Agent Ross.",
          "Agent Ross's cellphone video recorded during the January 7, 2026 shooting.",
          "All body-worn camera and dashcam footage from all ICE agents present at the scene.",
          "All records related to the January 7, 2026 Minneapolis operation: planning documents, target lists, after-action reports.",
          "All communications regarding the shooting and subsequent investigation.",
          "Current duty status and location of Agent Ross following this incident."
        ]
      },
      "doj": {
        "name": "DOJ",
        "fullName": "Department of Justice",
        "description": "U.S. Attorney reversed joint investigation; jurisdiction decisions.",
        "email": "MRUFOIA.Requests@usdoj.gov",
        "portal": "https://www.justice.gov/oip/submit-and-track-request-or-appeal",
        "address": "Department of Justice\nOffice of Information Policy\n6th Floor, 441 G Street, NW\nWashington, D.C. 20530",
        "requests": [
          "All records related to the U.S. Attorney's Office decision to reverse the joint investigation agreement with Minnesota BCA.",
          "All communications between DOJ, U.S. Attorney's Office, FBI, DHS, and ICE regarding federal jurisdiction over this case.",
          "All communications between DOJ and Minnesota officials (BCA, AG Keith Ellison, Hennepin County Attorney Mary Moriarty, Governor Walz).",
          "All records related to any civil rights review of this shooting.",
          "All legal memoranda regarding federal jurisdiction and immunity claims for ICE agents in officer-involved shootings.",
          "All records related to Vice President Vance's immunity claims and DOJ's legal analysis of same."
        ]
      }
    },
    "complaints": {
      "dhs-oig": {
        "name": "DHS Inspector General",
        "description": "Report false statements by Secretary Noem, excessive force, and obstruction.",
        "email": "DHS-OIG.OfficePublicAffairs@oig.dhs.gov",
        "portal": "https://www.oig.dhs.gov/hotline",
        "address": "Department of Homeland Security\nOffice of Inspector General\n245 Murray Lane SW\nWashington, D.C. 20528",
        "subject": "Complaint: False Statements, Excessive Force, and Obstruction - Renee Good Shooting",
        "allegations": [
          "UNJUSTIFIED USE OF DEADLY FORCE: ICE Agent Jonathan Ross shot Renee Nicole Good, a U.S. citizen, three times. Multiple videos show she posed no threat—Ross was standing out of her vehicle's path when he fired. She had smiled and said 'I'm not mad at you' moments before being killed.",
          "FALSE PUBLIC STATEMENTS: DHS Secretary Kristi Noem falsely characterized Good as engaged in 'domestic terrorism' and claimed the agent acted in self-defense because Good tried to run him over. Video evidence directly contradicts this—Minneapolis Mayor Frey called it 'bullshit.'",
          "OBSTRUCTION OF JUSTICE: Federal authorities reversed an agreement with Minnesota BCA for joint investigation, seized all evidence, and are blocking state investigators from accessing case materials, scene evidence, or investigative interviews.",
          "EVIDENCE SUPPRESSION: Agent Ross's cellphone video, his firearm, ammunition casings, and Good's vehicle are being withheld from state authorities who have jurisdiction to investigate.",
          "ABUSE OF AUTHORITY: Federal immunity claims appear designed to shield Agent Ross from state prosecution and accountability."
        ],
        "actions": [
          "Investigate Agent Jonathan Ross's use of deadly force",
          "Investigate Secretary Noem's false public statements",
          "Investigate the decision to block state investigators",
          "Investigate whether evidence is being suppressed or destroyed",
          "Preserve all video footage, including Agent Ross's cellphone video",
          "Refer criminal conduct to appropriate authorities"
        ]
      },
      "doj-oig": {
        "name": "DOJ Inspector General",
        "description": "Report obstruction of state investigation and abuse of federal jurisdiction.",
        "email": "oig.hotline@usdoj.gov",
        "portal": "https://oig.justice.gov/hotline",
        "address": "Department of Justice\nOffice of the Inspector General\n950 Pennsylvania Avenue, NW\nSuite 4706\nWashington, D.C. 20530",
        "subject": "Complaint: Obstruction of Justice and Abuse of Federal Jurisdiction - Renee Good Case",
        "allegations": [
          "OBSTRUCTION OF STATE INVESTIGATION: U.S. Attorney's Office reversed agreement for joint FBI-BCA investigation, seizing exclusive jurisdiction and blocking Minnesota officials from all evidence access.",
          "IMPROPER IMMUNITY CLAIMS: Vice President Vance claimed federal agents have immunity from state prosecution. Minnesota AG Keith Ellison called this a 'misstatement of the law.'",
          "COORDINATION TO OBSTRUCT: Communications between DOJ, DHS, FBI, ICE, and White House may reveal improper coordination to prevent state investigation and accountability.",
          "CIVIL RIGHTS VIOLATIONS: A U.S. citizen was killed by a federal agent, and federal authorities are preventing independent investigation of potential civil rights violations.",
          "UNDERMINING PUBLIC CONFIDENCE: Governor Walz stated 'it feels very, very difficult that we will get a fair outcome' given federal officials' pre-judgment of the case."
        ],
        "actions": [
          "Investigate DOJ's role in blocking state investigation",
          "Investigate the legal basis for immunity claims",
          "Investigate inter-agency communications regarding jurisdiction",
          "Determine if DOJ personnel participated in obstruction",
          "Preserve all records and evidence",
          "Refer criminal conduct to appropriate authorities"
        ]
      }
    },
    "congress": {
      "subject": "Request for Congressional Oversight - Killing of Renee Good by ICE Agent",
      "background": [
        "Renee Nicole Good, 37-year-old U.S. citizen, poet, and mother of three, was shot and killed by ICE Agent Jonathan Ross in Minneapolis on January 7, 2026, after dropping her 6-year-old son at school.",
        "Multiple videos show Good posed no threat. She smiled and said 'I'm not mad at you' moments before Ross fired three shots. Video shows Ross was standing out of her vehicle's path when he opened fire.",
        "DHS Secretary Kristi Noem called Good's actions 'domestic terrorism.' Minneapolis Mayor Frey called that claim 'bullshit.' Governor Walz proclaimed January 9 'Renee Good Day.'",
        "Federal authorities initially agreed to joint FBI-BCA investigation, then U.S. Attorney's Office 'reversed course' and seized exclusive jurisdiction.",
        "Minnesota BCA has been blocked from all evidence: Agent Ross's firearm, cellphone video, ammunition casings, Good's vehicle, and all investigative interviews.",
        "Minnesota AG Keith Ellison says federal immunity claims are 'misstatement of the law' and is pursuing independent investigation.",
        "Rep. Robin Kelly (IL) filed articles of impeachment against DHS Secretary Noem on January 14, 2026."
      ],
      "concerns": [
        "A U.S. citizen was killed by a federal agent while posing no apparent threat",
        "Video evidence contradicts official government statements",
        "Federal government is actively blocking state investigation with lawful jurisdiction",
        "Evidence at risk of suppression or destruction",
        "Dangerous precedent for federal agents avoiding accountability",
        "High-level officials making false public statements about the incident"
      ],
      "actions": [
        "Enter this matter into the Congressional Record",
        "Initiate oversight hearings on the killing and federal obstruction",
        "Subpoena all video footage, including Agent Ross's cellphone video",
        "Request records from DHS, DOJ, FBI, and ICE",
        "Investigate DHS Secretary Noem's public statements",
        "Consider legislation requiring state access to evidence in federal agent shootings",
        "Support Rep. Kelly's impeachment inquiry regarding Secretary Noem"
      ]
    }
  },
  "geraldo-lunas-campos": {
    "id": "geraldo-lunas-campos",
    "title": "Geraldo Lunas Campos Case",
    "date": "2026-01-16",
    "status": "active",
    "summary": "Cuban immigrant died in ICE detention. Medical examiner: asphyxia from neck/chest compression. DHS claims suicide attempt.",
    "keywords": ["ice", "detention", "texas", "el paso", "fort bliss", "homicide", "asphyxia"],
    "background": "On January 3, 2026, Geraldo Lunas Campos, a 55-year-old Cuban immigrant, died at Camp East Montana, a tent detention facility at Fort Bliss in El Paso, Texas. The medical examiner found asphyxia due to neck and chest compression and is expected to rule it a homicide. DHS claims he died during a suicide attempt. Witnesses say guards pinned and choked him.",
    "agencies": {
      "dhs": {
        "name": "DHS",
        "fullName": "Department of Homeland Security",
        "description": "Facility oversight, contractor management, and incident records.",
        "email": "foia@hq.dhs.gov",
        "portal": "https://www.dhs.gov/foia",
        "address": "Department of Homeland Security\nPrivacy Office, Mail Stop 0655\n2707 Martin Luther King Jr. Ave. SE\nWashington, D.C. 20528-0655",
        "requests": [
          "All records related to the death of Geraldo Lunas Campos on January 3, 2026, at Camp East Montana, Fort Bliss, El Paso, Texas.",
          "All incident reports, use-of-force reports, and after-action reports related to this death.",
          "All video footage, audio recordings, and body camera footage from the incident.",
          "All records related to Camp East Montana facility: contracts, oversight reports, inspection records, and complaints.",
          "All records related to Acquisition Logistics LLC, the contractor operating Camp East Montana.",
          "All communications between DHS, ICE, and the contractor regarding this death.",
          "All records related to witness statements from detainees, including Santos Jesus Flores.",
          "All records related to the deportation or transfer of witnesses to this death."
        ]
      },
      "ice": {
        "name": "ICE",
        "fullName": "Immigration and Customs Enforcement",
        "description": "Detention records, guard conduct, and use-of-force reports.",
        "email": "ice-foia@ice.dhs.gov",
        "portal": "https://www.ice.gov/foia",
        "address": "U.S. Immigration and Customs Enforcement\nFreedom of Information Act Office\n500 12th Street, S.W., Stop 5009\nWashington, D.C. 20536-5009",
        "requests": [
          "All records related to the death of Geraldo Lunas Campos at Camp East Montana on January 3, 2026.",
          "All records identifying guards and staff involved in the incident, including employment records, training, prior complaints, and use-of-force history.",
          "All medical records, incident reports, and internal communications regarding this death.",
          "All policies governing use of force in detention facilities, particularly regarding restraint techniques.",
          "All records related to deaths at Camp East Montana and other Fort Bliss detention facilities.",
          "All records related to the detention and transfer of Santos Jesus Flores and other witnesses.",
          "All records related to Geraldo Lunas Campos's detention: intake records, medical history, segregation placement, and incident history."
        ]
      },
      "fbi": {
        "name": "FBI",
        "fullName": "Federal Bureau of Investigation",
        "description": "FBI investigation into the death.",
        "email": "foiparequest@fbi.gov",
        "portal": "https://vault.fbi.gov/fdps-1/foia-request",
        "address": "Federal Bureau of Investigation\nAttn: FOIA/PA Request\nRecord/Information Dissemination Section\n170 Marcel Drive\nWinchester, VA 22602",
        "requests": [
          "All records related to any FBI investigation into the death of Geraldo Lunas Campos on January 3, 2026.",
          "All communications between FBI, DHS, ICE, and other agencies regarding this death.",
          "All witness statements, evidence collected, and investigative findings.",
          "All records related to potential civil rights violations in this case."
        ]
      },
      "doj": {
        "name": "DOJ",
        "fullName": "Department of Justice",
        "description": "Civil rights review and detention oversight.",
        "email": "MRUFOIA.Requests@usdoj.gov",
        "portal": "https://www.justice.gov/oip/submit-and-track-request-or-appeal",
        "address": "Department of Justice\nOffice of Information Policy\n6th Floor, 441 G Street, NW\nWashington, D.C. 20530",
        "requests": [
          "All records related to DOJ involvement in investigating the death of Geraldo Lunas Campos.",
          "All records related to civil rights review of deaths in ICE detention facilities.",
          "All communications between DOJ, DHS, ICE, and FBI regarding this case.",
          "All records related to DOJ oversight of detention facility contractors."
        ]
      }
    },
    "complaints": {
      "dhs-oig": {
        "name": "DHS Inspector General",
        "description": "Report misconduct, false statements, and potential cover-up.",
        "email": "DHS-OIG.OfficePublicAffairs@oig.dhs.gov",
        "portal": "https://www.oig.dhs.gov/hotline",
        "address": "Department of Homeland Security\nOffice of Inspector General\n245 Murray Lane SW\nWashington, D.C. 20528",
        "subject": "Complaint: Death of Geraldo Lunas Campos - Potential Homicide and Cover-Up",
        "allegations": [
          "EXCESSIVE USE OF FORCE: Detainee Geraldo Lunas Campos died from asphyxia due to neck and chest compression. Witness reports guards pinned and choked him while he said he could not breathe.",
          "FALSE OFFICIAL STATEMENTS: DHS claimed the death resulted from a suicide attempt, contradicted by medical examiner findings of asphyxia from compression.",
          "WITNESS INTIMIDATION: Reports indicate DHS has moved to deport witnesses to the death, potentially obstructing investigation.",
          "CONTRACTOR NEGLIGENCE: Camp East Montana is operated by Acquisition Logistics LLC, a company with no prior corrections experience, raising serious oversight concerns.",
          "SYSTEMIC FAILURES: Four immigrants died in ICE custody in the first 10 days of 2026, suggesting systemic problems."
        ],
        "actions": [
          "Investigate the death of Geraldo Lunas Campos",
          "Investigate false statements by DHS officials",
          "Investigate witness deportation as potential obstruction",
          "Investigate contractor oversight at Camp East Montana",
          "Preserve all evidence, video footage, and records",
          "Refer criminal conduct to appropriate authorities"
        ]
      },
      "doj-oig": {
        "name": "DOJ Inspector General",
        "description": "Report civil rights violations and obstruction of justice.",
        "email": "oig.hotline@usdoj.gov",
        "portal": "https://oig.justice.gov/hotline",
        "address": "Department of Justice\nOffice of the Inspector General\n950 Pennsylvania Avenue, NW\nSuite 4706\nWashington, D.C. 20530",
        "subject": "Complaint: Civil Rights Violations and Obstruction - Geraldo Lunas Campos Death",
        "allegations": [
          "CIVIL RIGHTS VIOLATIONS: Death from asphyxia due to neck and chest compression while in federal custody constitutes potential civil rights violations.",
          "OBSTRUCTION OF JUSTICE: Deportation of witnesses may constitute obstruction of the FBI investigation.",
          "FALSE STATEMENTS: Discrepancy between DHS's suicide claim and medical examiner's homicide determination.",
          "INADEQUATE OVERSIGHT: DOJ failure to properly oversee detention contractors operating facilities with no corrections experience."
        ],
        "actions": [
          "Investigate civil rights violations",
          "Investigate obstruction through witness deportation",
          "Investigate DOJ oversight of ICE detention facilities",
          "Preserve all records",
          "Refer criminal conduct to authorities"
        ]
      }
    },
    "congress": {
      "subject": "Request for Congressional Oversight - Geraldo Lunas Campos Death in ICE Custody",
      "background": [
        "Geraldo Lunas Campos, 55-year-old Cuban immigrant, died on January 3, 2026, at Camp East Montana, a tent detention facility at Fort Bliss.",
        "El Paso County medical examiner found cause of death was asphyxia due to neck and chest compression, expected to rule it a homicide.",
        "DHS claims he died during a suicide attempt, contradicting medical findings.",
        "Witness Santos Jesus Flores reports seeing guards restrain Lunas Campos and hearing him say he could not breathe.",
        "Camp East Montana is operated by Acquisition Logistics LLC, a company with no prior corrections experience.",
        "Reports indicate DHS is deporting witnesses to the death."
      ],
      "concerns": [
        "A man died from asphyxiation while in federal custody",
        "Official statements contradict medical examiner findings",
        "Witnesses are reportedly being deported, potentially obstructing investigation",
        "Inexperienced contractor operating $1.2 billion detention facility",
        "Four deaths in ICE custody in first 10 days of 2026"
      ],
      "actions": [
        "Enter this matter into the Congressional Record",
        "Initiate oversight hearings on ICE detention facility deaths",
        "Investigate contractor qualifications and oversight",
        "Request records from DHS, DOJ, FBI, and ICE",
        "Halt deportation of witnesses pending investigation",
        "Consider legislation requiring independent oversight of detention facilities"
      ]
    }
  },
  "keith-porter": {
    "id": "keith-porter",
    "title": "Keith Porter Case",
    "date": "2026-01-13",
    "status": "active",
    "summary": "Black father killed by off-duty ICE agent in LA on New Year's Eve. No bodycam, no witnesses confirm agent's account.",
    "keywords": ["ice", "los angeles", "shooting", "off-duty", "northridge", "lapd"],
    "background": "On December 31, 2025, Keith Porter Jr., a 43-year-old Black father, was shot and killed by an off-duty ICE agent at an apartment complex in Northridge, Los Angeles. The agent claims Porter pointed an AR-15 at him. There is no bodycam footage, video evidence, or witnesses to confirm this account. Neighbors say they did not hear the agent identify himself.",
    "agencies": {
      "dhs": {
        "name": "DHS",
        "fullName": "Department of Homeland Security",
        "description": "Agent records, policies, and internal investigation.",
        "email": "foia@hq.dhs.gov",
        "portal": "https://www.dhs.gov/foia",
        "address": "Department of Homeland Security\nPrivacy Office, Mail Stop 0655\n2707 Martin Luther King Jr. Ave. SE\nWashington, D.C. 20528-0655",
        "requests": [
          "All records related to the shooting death of Keith Porter Jr. on December 31, 2025, in Northridge, Los Angeles, by an off-duty ICE agent.",
          "All records related to the ICE agent involved, including employment records, training, prior complaints, disciplinary actions, and use-of-force history.",
          "All policies governing off-duty conduct of ICE agents, including use of service weapons.",
          "All communications between DHS, ICE, and LAPD regarding this incident.",
          "All records from ICE's Office of Professional Responsibility investigation.",
          "All public statements made by DHS officials regarding this incident."
        ]
      },
      "ice": {
        "name": "ICE",
        "fullName": "Immigration and Customs Enforcement",
        "description": "Agent records, training, and internal investigation.",
        "email": "ice-foia@ice.dhs.gov",
        "portal": "https://www.ice.gov/foia",
        "address": "U.S. Immigration and Customs Enforcement\nFreedom of Information Act Office\n500 12th Street, S.W., Stop 5009\nWashington, D.C. 20536-5009",
        "requests": [
          "All records related to the ICE agent involved in the shooting death of Keith Porter Jr. on December 31, 2025.",
          "All employment records, personnel files, training records, prior complaints, and use-of-force history for this agent.",
          "All records from the Office of Professional Responsibility investigation into this shooting.",
          "All policies governing off-duty use of ICE-authorized firearms.",
          "All policies governing ICE agent response to non-immigration-related incidents.",
          "All records of the agent's current duty status following this incident."
        ]
      },
      "doj": {
        "name": "DOJ",
        "fullName": "Department of Justice",
        "description": "Civil rights review and federal law enforcement oversight.",
        "email": "MRUFOIA.Requests@usdoj.gov",
        "portal": "https://www.justice.gov/oip/submit-and-track-request-or-appeal",
        "address": "Department of Justice\nOffice of Information Policy\n6th Floor, 441 G Street, NW\nWashington, D.C. 20530",
        "requests": [
          "All records related to DOJ involvement in the investigation of Keith Porter Jr.'s death.",
          "All records related to civil rights review of this shooting.",
          "All communications between DOJ, DHS, ICE, and local authorities regarding this case.",
          "All records related to DOJ policies on investigating off-duty federal law enforcement shootings."
        ]
      }
    },
    "complaints": {
      "dhs-oig": {
        "name": "DHS Inspector General",
        "description": "Report misconduct by off-duty ICE agent.",
        "email": "DHS-OIG.OfficePublicAffairs@oig.dhs.gov",
        "portal": "https://www.oig.dhs.gov/hotline",
        "address": "Department of Homeland Security\nOffice of Inspector General\n245 Murray Lane SW\nWashington, D.C. 20528",
        "subject": "Complaint: Off-Duty ICE Agent Shooting of Keith Porter Jr.",
        "allegations": [
          "UNJUSTIFIED USE OF DEADLY FORCE: Off-duty ICE agent shot and killed Keith Porter Jr. There is no bodycam footage, video evidence, or witness corroboration of the agent's claim that Porter pointed a weapon at him.",
          "FAILURE TO FOLLOW PROPER PROCEDURES: Rather than calling 911 and waiting for trained LAPD officers, the agent left his apartment with his service weapon to confront the situation.",
          "LACK OF ACCOUNTABILITY: Despite killing an unarmed civilian (in the sense of not actively threatening), the agent has not been arrested or charged.",
          "TRANSPARENCY CONCERNS: The agent's identity was not publicly released by DHS, only revealed through unrelated court documents."
        ],
        "actions": [
          "Investigate the shooting of Keith Porter Jr.",
          "Investigate whether the agent's use of force was justified",
          "Investigate why the agent confronted Porter rather than calling police",
          "Review policies on off-duty conduct and firearm use",
          "Preserve all evidence and records",
          "Refer findings to appropriate authorities"
        ]
      },
      "doj-oig": {
        "name": "DOJ Inspector General",
        "description": "Report civil rights violations and inadequate oversight.",
        "email": "oig.hotline@usdoj.gov",
        "portal": "https://oig.justice.gov/hotline",
        "address": "Department of Justice\nOffice of the Inspector General\n950 Pennsylvania Avenue, NW\nSuite 4706\nWashington, D.C. 20530",
        "subject": "Complaint: Civil Rights Concerns - Keith Porter Jr. Shooting",
        "allegations": [
          "POTENTIAL CIVIL RIGHTS VIOLATIONS: A Black man was killed by a federal agent with no independent evidence supporting the agent's account.",
          "INADEQUATE OVERSIGHT: DOJ has failed to ensure accountability for off-duty federal agents who use deadly force.",
          "LACK OF TRANSPARENCY: Federal agencies have not released information about the agent or investigation status."
        ],
        "actions": [
          "Investigate civil rights implications of this shooting",
          "Investigate DOJ oversight of off-duty federal law enforcement conduct",
          "Ensure independent review of the shooting",
          "Preserve all records"
        ]
      }
    },
    "congress": {
      "subject": "Request for Congressional Oversight - Keith Porter Jr. Shooting",
      "background": [
        "Keith Porter Jr., 43-year-old Black father, was shot and killed on New Year's Eve (December 31, 2025) by an off-duty ICE agent at an apartment complex in Northridge, Los Angeles.",
        "The ICE agent claims Porter pointed an AR-15 at him after celebratory gunfire.",
        "There is no bodycam footage, video evidence, or witnesses to confirm the agent's account.",
        "Neighbors report they did not hear the agent identify himself before shooting.",
        "The agent has not been arrested or charged. His identity was only revealed through unrelated court documents.",
        "Family and advocates are demanding transparency and accountability."
      ],
      "concerns": [
        "A Black man was killed by a federal agent with no corroborating evidence",
        "Off-duty agent chose to confront rather than call police",
        "No bodycam footage exists of the incident",
        "Agent has not been arrested or publicly identified by DHS",
        "Pattern of ICE agents using deadly force without accountability"
      ],
      "actions": [
        "Enter this matter into the Congressional Record",
        "Initiate oversight hearings on off-duty federal agent conduct",
        "Request records from DHS, ICE, and DOJ",
        "Investigate policies on off-duty use of force",
        "Consider legislation requiring bodycams for federal agents",
        "Ensure independent investigation of this shooting"
      ]
    }
  }
}
